%---------------------------- PSO fitting --------------------------------%
%Writer: Minsang Kim                                                      %
%Date 2024-06-17                                                          %
%-------------------------------------------------------------------------%
function [data,space,path,opt,condition] = Ni_YSZ1()
%%---------------------------------------------------create 'expdat' STRUCT
time_s = cell(1,3);
time_s{2} = [
    117.75 235.5 353.25 471.0 2983.2 5495.3 8007.5 10520 13032 15544 ...
    18056 20568 23080 25593 28105 30617 33129 35641 38153 40665 43178 ... 
    45690 48202 50714 53226 55738 58250 60763 63275 65787 68299 70811 ...
    73323 75836 78348 80860 83372 85884 88396 90908 93421 95933 98445 ...
    100960 103470 105980 108490 111010 113520 116030 118540 121050 ...
    123570 126080 128590 131100 133610 136130 138640 141150 143660 ...
    146180 148690 151200
    ];

time_s{1} = [
    79.2 158.4 237.6 316.8 1511.5 2706.2 3901.0 5095.7 6290.4 7485.1 ...
    8679.8 9874.6 11069 12264 13459 14653 15848 17043 18238 19432 20627 ...
    21822 23016 24211 25406 26601 27795 28990 30185 31380 32574 33769 ...
    34964 36158 37353 38548 39743 40937 42132 43327 44521 45716 46911 ...
    48106 49300 50495 51690 52884 54079 55274 56469 57663 58858 60053 ...
    61248 62442 63637 64832 66026 67221 68416 69611 70805 72000
    ];

time_s{3} = [
    90.0 180.0 270.0 360.0 6354.0 12348 18342 24336 30330 36324 42318 ...
    48312 54306 60300 66294 72288 78282 84276 90270 96264 102260 108250 ...
    114250 120240 126230 132230 138220 144220 150210 156200 162200 ...
    168190 174190 180180 186170 192170 198160 204160 210150 216140 ...
    222140 228130 234130 240120 246110 252110 258100 264100 270090 ...
    276080 282080 288070 294070 300060 306050 312050 318040 324040 ...
    330030 336020 342020 348010 354010 360000
    ];

sim_x = cell(1,3);

for i = 1:numel(time_s)
    sim_x{i} = time_s{i} / 3600;
end


temp = readmatrix("850_39.csv", 'Range', 'A2:A25');
exp_x{2} = temp.';
temp = readmatrix("850_39.csv", 'Range', 'B2:B25');
exp_y{2} = temp.';

temp = readmatrix("800_58.csv", 'Range', 'A2:A24');
exp_x{1} = temp.';
temp = readmatrix("800_58.csv", 'Range', 'B2:B24');
exp_y{1} = temp.';

temp = readmatrix("800_45.csv", 'Range', 'A2:A30');
exp_x{3} = temp.';
temp = readmatrix("800_45.csv", 'Range', 'B2:B30');
exp_y{3} = temp.';

data = struct('exp_x',exp_x,'exp_y',exp_y,'sim_x',sim_x);
%%----------------------------------------------------create 'Space' STRUCT
lb = [1.0e-22, 1.2, -1.2, 14801];
% range mode: 하한, nomalize mode: 평균
ub = [1.0e-13, 2.2, -0.2, 14801];
% range mode: 상한, nomalize mode: 표준편차
numpar = 200;

space = struct('lb',lb,'ub',ub,'numpar',numpar);
%%-----------------------------------------------------create 'path' STRUCT
ansysPath = ['"C:\Program Files\ANSYS Inc\v231\Framework\bin\Win64' ...
    '\RunWB2.exe"'];
workspace = "C:\linefiiting_nonpallel";
casefile = "case\Ni_YSZ\Ni_YSZ_files";

path = struct('ansyspath',ansysPath,'workspace',workspace, ...
    'casefile',casefile);
%%------------------------------------------------------create 'opt' STRUCT
mode  = 'custom';
maxEpoch = 30;
batch = 25;
log10comp = [1];

opt = struct('mode',mode,'maxEpoch',maxEpoch,'batch',batch, ...
    'log10comp',log10comp);
%%------------------------------------------------------------exp condition
temp(1) = 800;
temp(2) = 850;
temp(3) = 800;

Pressure(1) = maxstress(58)/(0.4^2*pi);
Pressure(2) = maxstress(39)/(0.4^2*pi);
Pressure(3) = maxstress(45)/(0.4^2*pi);

simtime(1) = 3600*42;
simtime(2) = 3600*20;
simtime(3) = 3600*100;

condition = struct('temp',temp,'Pressure',Pressure,'simtime',simtime);
%%---------------------------------------------------------------Max stress
function P = maxstress(sigma)
P = sigma/((1+0.33)*(0.485*log(2.5/0.4)+0.52+3/(2*pi*(1+0.33)))/(0.4^2));